Merge pull request #8 from ShiverKane/draft-supabase
chore(readme): reshape landing page for portfolio
